{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,5,5],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"conv1d_Conv1D1","class_name":"Conv1D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3],"strides":[1],"padding":"valid","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D1","trainable":true,"batch_input_shape":[null,5,5],"dtype":"float32"},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"max_pooling1d_MaxPooling1D1","class_name":"MaxPooling1D","config":{"pool_size":[2],"padding":"valid","strides":[2],"name":"max_pooling1d_MaxPooling1D1","trainable":true},"inbound_nodes":[[["conv1d_Conv1D1",0,0,{}]]]},{"name":"flatten_Flatten1","class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true},"inbound_nodes":[[["max_pooling1d_MaxPooling1D1",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":50,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["flatten_Flatten1",0,0,{}]]]},{"name":"regressionOutput","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"regressionOutput","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]},{"name":"classificationOutput","class_name":"Dense","config":{"units":3,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"classificationOutput","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["regressionOutput",0,0],["classificationOutput",0,0]]},"keras_version":"tfjs-layers 4.20.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv1d_Conv1D1/kernel","shape":[3,5,32],"dtype":"float32"},{"name":"conv1d_Conv1D1/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[32,50],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[50],"dtype":"float32"},{"name":"regressionOutput/kernel","shape":[50,1],"dtype":"float32"},{"name":"regressionOutput/bias","shape":[1],"dtype":"float32"},{"name":"classificationOutput/kernel","shape":[50,3],"dtype":"float32"},{"name":"classificationOutput/bias","shape":[3],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.20.0","convertedBy":null}