{"modelTopology":{"class_name":"Model","config":{"name":"model2","layers":[{"name":"input2","class_name":"InputLayer","config":{"batch_input_shape":[null,15,10],"dtype":"float32","sparse":false,"name":"input2"},"inbound_nodes":[]},{"name":"conv1d_Conv1D2","class_name":"Conv1D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3],"strides":[1],"padding":"valid","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D2","trainable":true},"inbound_nodes":[[["input2",0,0,{}]]]},{"name":"lstm_LSTM4","class_name":"LSTM","config":{"name":"lstm_LSTM4","trainable":true,"units":30,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.01}},"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false},"inbound_nodes":[[["conv1d_Conv1D2",0,0,{}]]]},{"name":"lstm_LSTM5","class_name":"LSTM","config":{"name":"lstm_LSTM5","trainable":true,"units":30,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.01}},"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false},"inbound_nodes":[[["lstm_LSTM4",0,0,{}]]]},{"name":"lstm_LSTM6","class_name":"LSTM","config":{"name":"lstm_LSTM6","trainable":true,"units":30,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.01}},"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false},"inbound_nodes":[[["lstm_LSTM5",0,0,{}]]]},{"name":"regressionOutput","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"regressionOutput","trainable":true},"inbound_nodes":[[["lstm_LSTM6",0,0,{}]]]},{"name":"classificationOutput","class_name":"Dense","config":{"units":3,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"classificationOutput","trainable":true},"inbound_nodes":[[["lstm_LSTM6",0,0,{}]]]}],"input_layers":[["input2",0,0]],"output_layers":[["regressionOutput",0,0],["classificationOutput",0,0]]},"keras_version":"tfjs-layers 4.21.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv1d_Conv1D2/kernel","shape":[3,10,64],"dtype":"float32"},{"name":"conv1d_Conv1D2/bias","shape":[64],"dtype":"float32"},{"name":"lstm_LSTM4/kernel","shape":[64,120],"dtype":"float32"},{"name":"lstm_LSTM4/recurrent_kernel","shape":[30,120],"dtype":"float32"},{"name":"lstm_LSTM4/bias","shape":[120],"dtype":"float32"},{"name":"lstm_LSTM5/kernel","shape":[30,120],"dtype":"float32"},{"name":"lstm_LSTM5/recurrent_kernel","shape":[30,120],"dtype":"float32"},{"name":"lstm_LSTM5/bias","shape":[120],"dtype":"float32"},{"name":"lstm_LSTM6/kernel","shape":[30,120],"dtype":"float32"},{"name":"lstm_LSTM6/recurrent_kernel","shape":[30,120],"dtype":"float32"},{"name":"lstm_LSTM6/bias","shape":[120],"dtype":"float32"},{"name":"regressionOutput/kernel","shape":[30,1],"dtype":"float32"},{"name":"regressionOutput/bias","shape":[1],"dtype":"float32"},{"name":"classificationOutput/kernel","shape":[30,3],"dtype":"float32"},{"name":"classificationOutput/bias","shape":[3],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.21.0","convertedBy":null}